<?php

use App\Film;
use Illuminate\Database\Seeder;

class FilmsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Film::create(['title'=>'Аладдин',
        'subtitle'=>'с дополнительными материалами',
        'content'=>'Бедный вор из восточного города Аграба Аладдин находит волшебную лампу с Джинном. У него есть только три желания, чтобы заслужить любовь принцессы, победить злодея-визиря и сделать всю Аграбу счастливее...',
        'imgsrc'=>'Aladdin_i02.jpg',
        'videourl'=>'https://www.youtube.com/embed/ufLWk-4tQ-o',
        'category'=>'Драмы']);
        Film::create(['title'=>'Герой',
        'subtitle'=>'Выпускник школы спецагентов Андрей получает весточку от своего отца и наставника Олега, которого считал погибшим',
        'content'=>'Выпускник школы спецагентов Андрей получает весточку от своего отца и наставника Олега, которого считал погибшим. Экс-разведчик предупреждает сына о таинственных врагах, уже идущих по его следу. Александр Петров...',
        'imgsrc'=>'geroy-2019_134963_0.jpg',
        'videourl'=>'https://www.youtube.com/embed/HeybaSSdZps',
        'category'=>'Триллеры']);
        Film::create(['title'=>'Покемон. Детектив Пикачу смотреть онлайн',
        'subtitle'=>'Pokémon Detective Pikachu',
        'content'=>'Элитный детектив Пикачу отправляется на поиски своего пропавшего напарника вместе с его сыном Тимом. Они проникают в тайны большого города, где люди живут бок о бок с волшебными покемонами. Герои...',
        'imgsrc'=>'Pikachu.jpg',
        'videourl'=>'https://www.youtube.com/embed/yNK56zegaOU',
        'category'=>'Фантастика']);
        Film::create(['title'=>'Т-34',
        'subtitle'=>'с дополнительными материалами',
        'content'=>'Плененный лейтенант Николай Ивушкин соглашается на роль живой мишени в испытании немецкого оружия против советских танков. Но сев в родной Т-34, Ивушкин организует немыслимый побег. Масштабную и зрелищную...',
        'imgsrc'=>'211px-Т-34,_постер_фильма.jpg',
        'videourl'=>'https://www.youtube.com/embed/FA6Xu_fgyzI',
        'category'=>'Драмы']);
        Film::create(['title'=>'Кролик Питер',
        'subtitle'=>'Peter Rabbit',
        'content'=>'Фильм режиссера Уилла Глака («Отличница легкого поведения», «Секс по дружбе»), в основу которого легли книги английской писательницы и художницы Беатрис Поттер. Путь на большой экран у их главного героя –...',
        'imgsrc'=>'uhd-4k-krolik-piter-2018_121514_0.jpg',
        'videourl'=>'https://www.youtube.com/embed/CHzUbsDA3tQ',
        'category'=>'Комедии']);
        Film::create(['title'=>'Лед',
        'subtitle'=>'с дополнительными материалами',
        'content'=>'Музыкальная сказка с Аглаей Тарасовой, Александром Петровым и Марией Ароновой в главных ролях. Иркутск, начало двухтысячных. Надя Лапшина мечтает стать фигуристкой, но местная влиятельная тренерша отвергает...',
        'imgsrc'=>'1516624784_led.jpeg',
        'videourl'=>'https://www.youtube.com/embed/rAR3XNuvBfI',
        'category'=>'Драмы']);
    }
}
